(13696, 300, 8)
(13696,)
epochs: 20
Shuffle: True
[1. 1. 1. ... 1. 1. 1.]
(10956, 300, 8)
weight0: 1.486970684039088
weight1: 0.7533003300330032
*****************************************
model_simple_ltsm
Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm (LSTM)                 (None, 4)                 208       
                                                                 
 dense (Dense)               (None, 8)                 40        
                                                                 
 dense_1 (Dense)             (None, 16)                144       
                                                                 
 dense_2 (Dense)             (None, 4)                 68        
                                                                 
 dense_3 (Dense)             (None, 1)                 5         
                                                                 
=================================================================
Total params: 465
Trainable params: 465
Non-trainable params: 0
_________________________________________________________________
