(72040, 75, 8)
(72040,)
epochs: 30
Shuffle: True
[1. 1. 1. ... 1. 1. 1.]
(57632, 75, 8)
weight0: 1.3256659152596955
weight1: 0.8027859033291544
*****************************************
stacked_lstm
Model: "sequential_7"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm_7 (LSTM)               (None, 75, 32)            5248      
                                                                 
 lstm_8 (LSTM)               (None, 24)                5472      
                                                                 
 dense_17 (Dense)            (None, 4)                 100       
                                                                 
 dense_18 (Dense)            (None, 1)                 5         
                                                                 
=================================================================
Total params: 10,825
Trainable params: 10,825
Non-trainable params: 0
_________________________________________________________________
