(13696, 300, 8)
(13696,)
epochs: 144
Shuffle: True
[1. 1. 1. ... 1. 1. 1.]
(10956, 300, 8)
weight0: 2.973941368078176
weight1: 1.5066006600660065
*****************************************
model_bigger_biggest_lstm_v16
Model: "sequential_16"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm_16 (LSTM)              (None, 256)               271360    
                                                                 
 dense_56 (Dense)            (None, 16)                4112      
                                                                 
 dense_57 (Dense)            (None, 16)                272       
                                                                 
 dense_58 (Dense)            (None, 16)                272       
                                                                 
 dense_59 (Dense)            (None, 16)                272       
                                                                 
 dense_60 (Dense)            (None, 16)                272       
                                                                 
 dense_61 (Dense)            (None, 16)                272       
                                                                 
 dense_62 (Dense)            (None, 16)                272       
                                                                 
 dense_63 (Dense)            (None, 16)                272       
                                                                 
 dense_64 (Dense)            (None, 16)                272       
                                                                 
 dense_65 (Dense)            (None, 16)                272       
                                                                 
 dense_66 (Dense)            (None, 16)                272       
                                                                 
 dense_67 (Dense)            (None, 16)                272       
                                                                 
 dense_68 (Dense)            (None, 16)                272       
                                                                 
 dense_69 (Dense)            (None, 16)                272       
                                                                 
 dense_70 (Dense)            (None, 1)                 17        
                                                                 
=================================================================
Total params: 279,025
Trainable params: 279,025
Non-trainable params: 0
_________________________________________________________________
*****************************************
-------------------------------
unique model id: model_bigger_biggest_lstm_v16-SGD1e-04
optimizer: SGD<tf.Variable 'learning_rate:0' shape=() dtype=float32, numpy=1e-04>
-------------------------------
loss : [1.3863320350646973, 1.3863049745559692, 1.3862942457199097, 1.3862931728363037, 1.386286735534668, 1.3862868547439575, 1.386274814605713, 1.3862688541412354, 1.3862711191177368, 1.3862587213516235, 1.3862543106079102, 1.38624906539917, 1.3862366676330566, 1.3862249851226807, 1.3862096071243286, 1.386195421218872, 1.3861641883850098, 1.386133074760437, 1.3861032724380493, 1.3860609531402588, 1.3859962224960327, 1.385923147201538, 1.3857444524765015, 1.38551664352417, 1.3852996826171875, 1.3851007223129272, 1.3849283456802368, 1.3849573135375977, 1.3847202062606812, 1.384506344795227, 1.3843079805374146, 1.3841149806976318, 1.3839465379714966, 1.383740782737732, 1.3833733797073364, 1.3831132650375366, 1.3828344345092773, 1.3824695348739624, 1.3821130990982056, 1.3815826177597046, 1.3812469244003296, 1.38096022605896, 1.3804160356521606, 1.3799793720245361, 1.3793487548828125, 1.3789386749267578, 1.3789697885513306, 1.3783386945724487, 1.3777674436569214, 1.3765547275543213, 1.376362919807434, 1.3767614364624023, 1.3751715421676636, 1.374409794807434, 1.3732444047927856, 1.372135877609253, 1.3716496229171753, 1.3697569370269775, 1.3691657781600952, 1.3682711124420166, 1.3667323589324951, 1.3660824298858643, 1.3643065690994263, 1.3625136613845825, 1.3621575832366943, 1.361022710800171, 1.3577055931091309, 1.3567466735839844, 1.3538496494293213, 1.3523849248886108, 1.3534804582595825, 1.3531875610351562, 1.3488043546676636, 1.3448621034622192, 1.3444571495056152, 1.3441176414489746, 1.3428186178207397, 1.3400181531906128, 1.3400753736495972, 1.3368371725082397, 1.3325371742248535, 1.3389747142791748, 1.3311184644699097, 1.331402063369751, 1.3269743919372559, 1.3273675441741943, 1.3290457725524902, 1.3302394151687622, 1.3256876468658447, 1.3190141916275024, 1.325455904006958, 1.3252524137496948, 1.32129967212677, 1.3233119249343872, 1.3151217699050903, 1.316237211227417, 1.3154454231262207, 1.3179906606674194, 1.3132141828536987, 1.3123133182525635, 1.3095581531524658, 1.304695963859558, 1.316052794456482, 1.3081098794937134, 1.3042734861373901, 1.3024402856826782, 1.3019356727600098, 1.3009347915649414, 1.303972601890564, 1.299816370010376, 1.295243501663208, 1.2982944250106812, 1.3011125326156616, 1.3025953769683838, 1.2957664728164673, 1.3036525249481201, 1.2925753593444824, 1.2936769723892212, 1.2926782369613647, 1.2934322357177734, 1.2900264263153076, 1.2899614572525024, 1.2899668216705322, 1.2850404977798462, 1.28963041305542, 1.288904070854187, 1.2853528261184692, 1.2816890478134155, 1.2875956296920776, 1.2882999181747437, 1.288286805152893, 1.2885440587997437, 1.2799181938171387, 1.2847959995269775, 1.2872767448425293, 1.2812526226043701, 1.2825425863265991, 1.2858729362487793, 1.2824956178665161, 1.280238151550293, 1.2872350215911865, 1.2826368808746338, 1.289734125137329, 1.2813800573349]
tp : [1163.0, 1283.0, 856.0, 2933.0, 263.0, 74.0, 5651.0, 4333.0, 1998.0, 3236.0, 3749.0, 6034.0, 4587.0, 4377.0, 3924.0, 4295.0, 1846.0, 5398.0, 3002.0, 2854.0, 2278.0, 1978.0, 2255.0, 2661.0, 2246.0, 2533.0, 2503.0, 2264.0, 2662.0, 2722.0, 2571.0, 2569.0, 2413.0, 2701.0, 2483.0, 2464.0, 2490.0, 2507.0, 2440.0, 2474.0, 2405.0, 2446.0, 2487.0, 2472.0, 2398.0, 2471.0, 2769.0, 2934.0, 2719.0, 3046.0, 3604.0, 2994.0, 3356.0, 3485.0, 3377.0, 3359.0, 2979.0, 3408.0, 3320.0, 3168.0, 3185.0, 3239.0, 2804.0, 2899.0, 2893.0, 2999.0, 3142.0, 2731.0, 3050.0, 2720.0, 2811.0, 2671.0, 3109.0, 3208.0, 3068.0, 2832.0, 2872.0, 2795.0, 3015.0, 3169.0, 3054.0, 2782.0, 3197.0, 3185.0, 3199.0, 3017.0, 2968.0, 2765.0, 2717.0, 3215.0, 2799.0, 2620.0, 2705.0, 2575.0, 2692.0, 2528.0, 2854.0, 3031.0, 2736.0, 2701.0, 2719.0, 2685.0, 2565.0, 2578.0, 2605.0, 2676.0, 2711.0, 2829.0, 3119.0, 2712.0, 2714.0, 2674.0, 2719.0, 2590.0, 3163.0, 2914.0, 2824.0, 2808.0, 2999.0, 2756.0, 3211.0, 3046.0, 2906.0, 3077.0, 2797.0, 2969.0, 2877.0, 3302.0, 3223.0, 2987.0, 3124.0, 3155.0, 3158.0, 3058.0, 3088.0, 2999.0, 2781.0, 2986.0, 2973.0, 3119.0, 3129.0, 3011.0, 2803.0, 3303.0]
tn : [3013.0, 3024.0, 3252.0, 2187.0, 3573.0, 3658.0, 862.0, 1551.0, 2831.0, 2112.0, 1835.0, 724.0, 1553.0, 1614.0, 1880.0, 1729.0, 3059.0, 1085.0, 2468.0, 2551.0, 2911.0, 3099.0, 2968.0, 2694.0, 2975.0, 2784.0, 2834.0, 2944.0, 2732.0, 2687.0, 2803.0, 2799.0, 2907.0, 2692.0, 2874.0, 2889.0, 2882.0, 2876.0, 2927.0, 2931.0, 2958.0, 2953.0, 2926.0, 2980.0, 3027.0, 2970.0, 2781.0, 2735.0, 2808.0, 2732.0, 2384.0, 2723.0, 2552.0, 2505.0, 2602.0, 2617.0, 2797.0, 2640.0, 2675.0, 2755.0, 2732.0, 2740.0, 2925.0, 2890.0, 2880.0, 2819.0, 2779.0, 2979.0, 2842.0, 3002.0, 2923.0, 2975.0, 2776.0, 2795.0, 2826.0, 2922.0, 2913.0, 2967.0, 2832.0, 2726.0, 2846.0, 2936.0, 2756.0, 2740.0, 2778.0, 2862.0, 2865.0, 2945.0, 2982.0, 2803.0, 2959.0, 3046.0, 3029.0, 3056.0, 3051.0, 3119.0, 2976.0, 2856.0, 3026.0, 3032.0, 3035.0, 3080.0, 3086.0, 3097.0, 3096.0, 3091.0, 3044.0, 3014.0, 2848.0, 3039.0, 3076.0, 3045.0, 3031.0, 3107.0, 2847.0, 2918.0, 3021.0, 3014.0, 2903.0, 3029.0, 2849.0, 2913.0, 2938.0, 2914.0, 3030.0, 2945.0, 3000.0, 2788.0, 2825.0, 2949.0, 2855.0, 2873.0, 2877.0, 2930.0, 2853.0, 2932.0, 3013.0, 2969.0, 2971.0, 2916.0, 2847.0, 2958.0, 2987.0, 2810.0]
accuracy : [0.38116100430488586, 0.3931179344654083, 0.37495437264442444, 0.46732383966445923, 0.35012778639793396, 0.3406352698802948, 0.5944687724113464, 0.5370573401451111, 0.44076305627822876, 0.48813435435295105, 0.5096750855445862, 0.6168309450149536, 0.5604234933853149, 0.5468236804008484, 0.5297554135322571, 0.5498356819152832, 0.4476999044418335, 0.591730535030365, 0.4992698132991791, 0.4933369755744934, 0.47362175583839417, 0.4633990526199341, 0.4767250716686249, 0.48877328634262085, 0.47654253244400024, 0.4853048622608185, 0.487130343914032, 0.47535598278045654, 0.49233296513557434, 0.49370208382606506, 0.49050748348236084, 0.48995983600616455, 0.4855786859989166, 0.49224168062210083, 0.4889558255672455, 0.48859071731567383, 0.4903249442577362, 0.4913289546966553, 0.48986855149269104, 0.4933369755744934, 0.4895034730434418, 0.4927893280982971, 0.4940671920776367, 0.4976268708705902, 0.4951624572277069, 0.49662286043167114, 0.5065717697143555, 0.5174333453178406, 0.5044724345207214, 0.5273822546005249, 0.5465498566627502, 0.5218145251274109, 0.5392479300498962, 0.5467323660850525, 0.5457283854484558, 0.5454545617103577, 0.5271996855735779, 0.5520262718200684, 0.5471887588500977, 0.5406169891357422, 0.5400693416595459, 0.5457283854484558, 0.5229098200798035, 0.5283862948417664, 0.5269258618354797, 0.5310332179069519, 0.5404344797134399, 0.5211756229400635, 0.5377874970436096, 0.522270917892456, 0.5233662128448486, 0.5153340697288513, 0.5371485948562622, 0.547918975353241, 0.5379700660705566, 0.5251916646957397, 0.5280211567878723, 0.5259218811988831, 0.5336802005767822, 0.5380613207817078, 0.5385177135467529, 0.521905779838562, 0.5433552265167236, 0.5407995581626892, 0.5455458164215088, 0.5366009473800659, 0.5324023365974426, 0.5211756229400635, 0.520171582698822, 0.5492880344390869, 0.525556743144989, 0.5171595215797424, 0.5233662128448486, 0.5139649510383606, 0.5241876840591431, 0.5154253244400024, 0.5321285128593445, 0.5373311638832092, 0.5259218811988831, 0.5232748985290527, 0.5251916646957397, 0.5261957049369812, 0.5157904624938965, 0.5179809927940369, 0.520354151725769, 0.5263782143592834, 0.5252829790115356, 0.5333150625228882, 0.5446330904960632, 0.5249178409576416, 0.5284775495529175, 0.5219970941543579, 0.5248265862464905, 0.5199890732765198, 0.5485578775405884, 0.5323110818862915, 0.5334976315498352, 0.5313982963562012, 0.5387002825737, 0.5280211567878723, 0.5531215667724609, 0.5439028739929199, 0.5334063768386841, 0.5468236804008484, 0.5318546891212463, 0.5397955179214478, 0.5364183783531189, 0.5558598041534424, 0.5520262718200684, 0.5418035984039307, 0.5457283854484558, 0.5502008199691772, 0.5508397221565247, 0.5465498566627502, 0.542259931564331, 0.5413472056388855, 0.5288426280021667, 0.5435377955436707, 0.5425337553024292, 0.5508397221565247, 0.5454545617103577, 0.5448155999183655, 0.5284775495529175, 0.5579590797424316]
precision : [0.6341330409049988, 0.6603190898895264, 0.6645962595939636, 0.6620767712593079, 0.7032085657119751, 0.7400000095367432, 0.6669420599937439, 0.6701206564903259, 0.700806736946106, 0.6730449199676514, 0.669703483581543, 0.6708917021751404, 0.6827924847602844, 0.6789204478263855, 0.6850558519363403, 0.6872000098228455, 0.7470659613609314, 0.6750031113624573, 0.7117117047309875, 0.7158264517784119, 0.7466404438018799, 0.771751880645752, 0.7590036988258362, 0.7288414239883423, 0.7600677013397217, 0.737838625907898, 0.7464956641197205, 0.7536618113517761, 0.736579954624176, 0.7319172024726868, 0.7447856068611145, 0.7437753081321716, 0.7564263343811035, 0.7313836812973022, 0.7540236711502075, 0.7560601234436035, 0.7563791275024414, 0.7562594413757324, 0.7632155418395996, 0.7666563391685486, 0.7681251764297485, 0.7699087262153625, 0.7664098739624023, 0.7783375382423401, 0.7849427461624146, 0.7758241891860962, 0.7540849447250366, 0.7556013464927673, 0.7563282251358032, 0.7618809342384338, 0.734910249710083, 0.7570164203643799, 0.7477718591690063, 0.7472127079963684, 0.7573447227478027, 0.7589245438575745, 0.7705639004707336, 0.7654986381530762, 0.7669207453727722, 0.7732487320899963, 0.769881546497345, 0.7743246555328369, 0.7869772911071777, 0.7849986553192139, 0.7825263738632202, 0.7761387228965759, 0.7763775587081909, 0.7948195338249207, 0.7836588025093079, 0.7995296716690063, 0.7869541049003601, 0.7902367115020752, 0.7739606499671936, 0.7830119729042053, 0.7814569473266602, 0.7879799604415894, 0.7883612513542175, 0.7958428263664246, 0.7796741724014282, 0.7678701281547546, 0.7846865653991699, 0.7881019711494446, 0.7750303149223328, 0.7713732123374939, 0.7792935371398926, 0.785881757736206, 0.7837338447570801, 0.7890982031822205, 0.7946767807006836, 0.784912109375, 0.7942678928375244, 0.8041743636131287, 0.805059552192688, 0.8039337992668152, 0.8096240758895874, 0.817329466342926, 0.8012352585792542, 0.7854366302490234, 0.8061284422874451, 0.805547297000885, 0.8073040246963501, 0.8163575530052185, 0.8109389543533325, 0.8145339488983154, 0.8158471584320068, 0.8185989856719971, 0.809012234210968, 0.8085167407989502, 0.7886220216751099, 0.8078641891479492, 0.8169777393341064, 0.8071234822273254, 0.8063463568687439, 0.8178086280822754, 0.7907500267028809, 0.791847825050354, 0.8098652362823486, 0.8073605298995972, 0.7933862209320068, 0.8079742193222046, 0.7936233282089233, 0.798008918762207, 0.7957283854484558, 0.7998440265655518, 0.8104897141456604, 0.8007012009620667, 0.8079191446304321, 0.7865650057792664, 0.7895639538764954, 0.802525520324707, 0.7902858853340149, 0.7955118417739868, 0.7964690923690796, 0.8022035956382751, 0.7879561185836792, 0.7995201349258423, 0.8056199550628662, 0.8068089485168457, 0.8065654039382935, 0.8024182915687561, 0.7889561057090759, 0.8057265281677246, 0.8008571267127991, 0.7907589077949524]
val_loss : [0.6933476328849792, 0.6930700540542603, 0.6933218836784363, 0.6931377053260803, 0.6932466626167297, 0.6932341456413269, 0.6930939555168152, 0.6931120157241821, 0.6930564641952515, 0.6930475831031799, 0.6931350827217102, 0.6930287480354309, 0.6930726170539856, 0.6930142045021057, 0.6931690573692322, 0.6931507587432861, 0.6929540038108826, 0.69320148229599, 0.6932613849639893, 0.6933525204658508, 0.6933456659317017, 0.6931740641593933, 0.6929442286491394, 0.6931273937225342, 0.6932100653648376, 0.6933857798576355, 0.693198561668396, 0.6927228569984436, 0.6930713653564453, 0.6932018995285034, 0.692327082157135, 0.6928654909133911, 0.6924350261688232, 0.6927344799041748, 0.6923586130142212, 0.6928308606147766, 0.6927371025085449, 0.6931617259979248, 0.6916154623031616, 0.6913142800331116, 0.6933276653289795, 0.6915871500968933, 0.6908067464828491, 0.6906633377075195, 0.6906569600105286, 0.6894470453262329, 0.688191831111908, 0.6890159845352173, 0.6875259280204773, 0.6870442628860474, 0.6898851990699768, 0.6856642365455627, 0.6871033310890198, 0.6872392892837524, 0.6887044310569763, 0.686313807964325, 0.6862543821334839, 0.6832891702651978, 0.6858186721801758, 0.6860068440437317, 0.6922065615653992, 0.6892939805984497, 0.6891937851905823, 0.681782603263855, 0.6869388818740845, 0.6751723885536194, 0.6839960217475891, 0.6846436262130737, 0.6853938102722168, 0.679362416267395, 0.6848345994949341, 0.68301922082901, 0.6999974846839905, 0.6692159175872803, 0.6957993507385254, 0.6569903492927551, 0.669447660446167, 0.68543541431427, 0.6774156093597412, 0.692037045955658, 0.6590765714645386, 0.6672901511192322, 0.6504724621772766, 0.6438155770301819, 0.6805692315101624, 0.6410896182060242, 0.6909340620040894, 0.6675230860710144, 0.6681119203567505, 0.6668626070022583, 0.6676757335662842, 0.6729251146316528, 0.664918839931488, 0.7077239155769348, 0.6757824420928955, 0.6781908273696899, 0.6716967225074768, 0.6908434629440308, 0.7048693299293518, 0.6270796656608582, 0.6799259185791016, 0.6419628262519836, 0.6571011543273926, 0.6492398381233215, 0.6318526268005371, 0.6269350051879883, 0.6248437762260437, 0.6488874554634094, 0.664955198764801, 0.6288508176803589, 0.6589609980583191, 0.6606989502906799, 0.6703251004219055, 0.657433271408081, 0.6391636729240417, 0.625497043132782, 0.627031683921814, 0.6345739960670471, 0.7141537666320801, 0.6443162560462952, 0.6842024326324463, 0.638865053653717, 0.6448529958724976, 0.6864803433418274, 0.6382547616958618, 0.6618286967277527, 0.6300490498542786, 0.6842276453971863, 0.6320777535438538, 0.685310423374176, 0.6412234306335449, 0.6597107648849487, 0.6427270174026489, 0.6412031650543213, 0.6372824311256409, 0.6836162805557251, 0.6453419327735901, 0.6320329308509827, 0.639457106590271, 0.6155036687850952, 0.6416975855827332, 0.6902368068695068, 0.6256042718887329, 0.6460619568824768]
val_tp : [0.0, 1831.0, 0.0, 690.0, 2.0, 47.0, 1476.0, 834.0, 1830.0, 1831.0, 626.0, 1685.0, 911.0, 1328.0, 583.0, 592.0, 1054.0, 567.0, 553.0, 528.0, 500.0, 585.0, 594.0, 578.0, 585.0, 555.0, 571.0, 621.0, 609.0, 596.0, 702.0, 606.0, 645.0, 624.0, 606.0, 561.0, 568.0, 528.0, 660.0, 614.0, 486.0, 627.0, 603.0, 629.0, 583.0, 801.0, 939.0, 754.0, 935.0, 1020.0, 808.0, 1179.0, 1030.0, 922.0, 753.0, 957.0, 875.0, 1083.0, 795.0, 807.0, 479.0, 610.0, 613.0, 829.0, 630.0, 1066.0, 608.0, 643.0, 576.0, 620.0, 612.0, 650.0, 350.0, 869.0, 438.0, 1443.0, 698.0, 560.0, 642.0, 453.0, 997.0, 805.0, 1214.0, 1412.0, 551.0, 1266.0, 485.0, 777.0, 641.0, 700.0, 667.0, 560.0, 603.0, 318.0, 508.0, 389.0, 659.0, 415.0, 370.0, 1319.0, 394.0, 865.0, 540.0, 664.0, 910.0, 1026.0, 1182.0, 595.0, 723.0, 892.0, 556.0, 694.0, 527.0, 543.0, 723.0, 1218.0, 1009.0, 823.0, 326.0, 659.0, 436.0, 744.0, 573.0, 466.0, 765.0, 468.0, 901.0, 445.0, 770.0, 420.0, 660.0, 508.0, 832.0, 729.0, 683.0, 449.0, 712.0, 727.0, 659.0, 1335.0, 597.0, 368.0, 1053.0, 693.0]
val_tn : [909.0, 0.0, 909.0, 655.0, 909.0, 904.0, 281.0, 582.0, 0.0, 0.0, 707.0, 114.0, 540.0, 338.0, 717.0, 712.0, 459.0, 725.0, 731.0, 737.0, 758.0, 719.0, 710.0, 722.0, 723.0, 729.0, 726.0, 693.0, 712.0, 714.0, 659.0, 711.0, 701.0, 713.0, 719.0, 735.0, 735.0, 755.0, 699.0, 726.0, 781.0, 724.0, 746.0, 737.0, 754.0, 597.0, 566.0, 675.0, 566.0, 550.0, 640.0, 463.0, 552.0, 583.0, 706.0, 598.0, 623.0, 553.0, 673.0, 639.0, 839.0, 765.0, 777.0, 644.0, 762.0, 541.0, 780.0, 754.0, 800.0, 776.0, 776.0, 741.0, 864.0, 632.0, 840.0, 312.0, 729.0, 806.0, 748.0, 839.0, 575.0, 662.0, 471.0, 331.0, 802.0, 380.0, 842.0, 668.0, 780.0, 736.0, 757.0, 808.0, 792.0, 878.0, 815.0, 874.0, 769.0, 857.0, 868.0, 397.0, 864.0, 661.0, 821.0, 779.0, 631.0, 591.0, 494.0, 785.0, 742.0, 643.0, 819.0, 705.0, 843.0, 814.0, 745.0, 477.0, 576.0, 700.0, 882.0, 786.0, 865.0, 754.0, 798.0, 854.0, 709.0, 853.0, 648.0, 866.0, 739.0, 864.0, 774.0, 847.0, 695.0, 755.0, 758.0, 862.0, 755.0, 735.0, 772.0, 368.0, 791.0, 868.0, 555.0, 767.0]
val_accuracy : [0.33175182342529297, 0.668248176574707, 0.33175182342529297, 0.49087589979171753, 0.3324817419052124, 0.3470802903175354, 0.6412408947944641, 0.5167883038520813, 0.6678832173347473, 0.668248176574707, 0.48649635910987854, 0.6565693616867065, 0.5295620560646057, 0.6080291867256165, 0.47445255517959595, 0.4759124219417572, 0.5521897673606873, 0.4715328514575958, 0.4686131477355957, 0.4616788327693939, 0.4591240882873535, 0.4759124219417572, 0.4759124219417572, 0.47445255517959595, 0.47737225890159607, 0.4686131477355957, 0.4733576774597168, 0.47956204414367676, 0.48211678862571716, 0.4781021773815155, 0.49671533703804016, 0.4806569218635559, 0.49124088883399963, 0.4879561960697174, 0.4835766553878784, 0.4729926884174347, 0.4755474328994751, 0.468248188495636, 0.49598538875579834, 0.48905110359191895, 0.46240875124931335, 0.4930656850337982, 0.4923357665538788, 0.49854013323783875, 0.4879561960697174, 0.5102189779281616, 0.5492700934410095, 0.5215328335762024, 0.5478101968765259, 0.5729926824569702, 0.5284671783447266, 0.5992700457572937, 0.5773722529411316, 0.5492700934410095, 0.5324817299842834, 0.5675182342529297, 0.5467153191566467, 0.5970802903175354, 0.5357664227485657, 0.5277372002601624, 0.481021910905838, 0.5018247961997986, 0.5072992444038391, 0.5375912189483643, 0.5080292224884033, 0.5864963531494141, 0.5065693259239197, 0.5098540186882019, 0.5021897554397583, 0.5094890594482422, 0.5065693259239197, 0.5076642632484436, 0.44306570291519165, 0.5478101968765259, 0.466423362493515, 0.6405109763145447, 0.520802915096283, 0.49854013323783875, 0.5072992444038391, 0.4715328514575958, 0.5737226009368896, 0.535401463508606, 0.6149635314941406, 0.6361314058303833, 0.49379563331604004, 0.6007299423217773, 0.48430657386779785, 0.5273722410202026, 0.5186131596565247, 0.5240876078605652, 0.5197080373764038, 0.49927008152008057, 0.5091241002082825, 0.4364963471889496, 0.4828467071056366, 0.4609489142894745, 0.5211678743362427, 0.4642335772514343, 0.451824814081192, 0.6262773871421814, 0.4591240882873535, 0.5569342970848083, 0.49671533703804016, 0.5266423225402832, 0.5624087452888489, 0.590146005153656, 0.6116788387298584, 0.5036496520042419, 0.5346715450286865, 0.5602189898490906, 0.5018247961997986, 0.5105839371681213, 0.5, 0.4952554702758789, 0.5357664227485657, 0.6186131238937378, 0.5784671306610107, 0.5558394193649292, 0.44087591767311096, 0.5273722410202026, 0.47481751441955566, 0.5467153191566467, 0.5003649592399597, 0.48175182938575745, 0.537956178188324, 0.48211678862571716, 0.5653284788131714, 0.4784671664237976, 0.5507299304008484, 0.4686131477355957, 0.5233576893806458, 0.4945255517959595, 0.5572992563247681, 0.5416058301925659, 0.5259124040603638, 0.4784671664237976, 0.535401463508606, 0.5335766673088074, 0.5222627520561218, 0.6215328574180603, 0.5065693259239197, 0.4510948956012726, 0.5868613123893738, 0.5328466892242432]
val_precision : [0.0, 0.668248176574707, 0.0, 0.7309321761131287, 1.0, 0.9038461446762085, 0.7015209197998047, 0.7183462381362915, 0.6681270599365234, 0.668248176574707, 0.7560386657714844, 0.6794354915618896, 0.711718738079071, 0.6993154287338257, 0.7522580623626709, 0.750316858291626, 0.7007978558540344, 0.7549933195114136, 0.7564979195594788, 0.7542856931686401, 0.7680491805076599, 0.7548387050628662, 0.7490542531013489, 0.7555555701255798, 0.7587548494338989, 0.7551020383834839, 0.7572944164276123, 0.7419354915618896, 0.7555831074714661, 0.753476619720459, 0.7373949289321899, 0.753731369972229, 0.7561547756195068, 0.7609755992889404, 0.7613065242767334, 0.7632653117179871, 0.7654986381530762, 0.774193525314331, 0.7586206793785095, 0.7703889608383179, 0.791530966758728, 0.7721675038337708, 0.7872062921524048, 0.7852684259414673, 0.7899729013442993, 0.7196765542030334, 0.7324492931365967, 0.7631579041481018, 0.7316119074821472, 0.7396664023399353, 0.7502321004867554, 0.725538432598114, 0.742609977722168, 0.7387820482254028, 0.7876569032669067, 0.7547318339347839, 0.7536606192588806, 0.7526059746742249, 0.7710960507392883, 0.7493036389350891, 0.8724954724311829, 0.8090185523033142, 0.8228188157081604, 0.7577696442604065, 0.8108108043670654, 0.7433751821517944, 0.8249660730361938, 0.8057644367218018, 0.8408759236335754, 0.8233731985092163, 0.8214765191078186, 0.7946210503578186, 0.8860759735107422, 0.7582896947860718, 0.8639053106307983, 0.7073529362678528, 0.7949886322021484, 0.8446455597877502, 0.799501895904541, 0.866156816482544, 0.749060869216919, 0.7652091383934021, 0.7348668575286865, 0.709547758102417, 0.8373860120773315, 0.7052924633026123, 0.8786231875419617, 0.7632613182067871, 0.8324675559997559, 0.8018327355384827, 0.8144078254699707, 0.8472012281417847, 0.8374999761581421, 0.9111747741699219, 0.8438538312911987, 0.9174528121948242, 0.8247810006141663, 0.8886509537696838, 0.9002432823181152, 0.7203713655471802, 0.8974943161010742, 0.7771788239479065, 0.8598726391792297, 0.8362720608711243, 0.7659932374954224, 0.7633928656578064, 0.7401377558708191, 0.827538251876831, 0.8123595714569092, 0.7702935934066772, 0.8606811165809631, 0.7728285193443298, 0.8887014985084534, 0.8510971665382385, 0.8151071071624756, 0.7381818294525146, 0.7518628835678101, 0.7974806427955627, 0.9235127568244934, 0.8427109718322754, 0.9083333611488342, 0.8275862336158752, 0.8377193212509155, 0.8944337964057922, 0.7927461266517639, 0.8931297659873962, 0.7753872871398926, 0.9118852615356445, 0.8191489577293396, 0.9032257795333862, 0.8301886916160583, 0.8912280797958374, 0.7954111099243164, 0.8255945444107056, 0.8189448714256287, 0.9052419066429138, 0.8221709132194519, 0.8068812489509583, 0.8278894424438477, 0.7116204500198364, 0.8349650502204895, 0.8997554779052734, 0.748400866985321, 0.829940140247345]
