(7775, 300, 8)
(7775,)
epochs: 30
Shuffle: True
[1. 1. 1. ... 1. 1. 1.]
(6220, 300, 8)
weight0: 1.5932377049180328
weight1: 0.7286785379568885
*****************************************
model_stacked_v6
Model: "sequential_18"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm_17 (LSTM)              (None, 300, 256)          271360    
                                                                 
 lstm_18 (LSTM)              (None, 300, 256)          525312    
                                                                 
 lstm_19 (LSTM)              (None, 300, 128)          197120    
                                                                 
 lstm_20 (LSTM)              (None, 300, 128)          131584    
                                                                 
 lstm_21 (LSTM)              (None, 64)                49408     
                                                                 
 dense_71 (Dense)            (None, 1)                 65        
                                                                 
=================================================================
Total params: 1,174,849
Trainable params: 1,174,849
Non-trainable params: 0
_________________________________________________________________
