(7729, 300, 8)
(7729,)
epochs: 16
Shuffle: True
[1. 1. 1. ... 1. 1. 1.]
(6183, 300, 8)
weight0: 4.546323529411764
weight1: 0.561784481192077
*****************************************
model_simple_ltsm
Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm (LSTM)                 (None, 4)                 208       
                                                                 
 dense (Dense)               (None, 8)                 40        
                                                                 
 dense_1 (Dense)             (None, 16)                144       
                                                                 
 dense_2 (Dense)             (None, 4)                 68        
                                                                 
 dense_3 (Dense)             (None, 1)                 5         
                                                                 
=================================================================
Total params: 465
Trainable params: 465
Non-trainable params: 0
_________________________________________________________________
