(13696, 300, 8)
(13696,)
epochs: 30
Shuffle: True
[1. 1. 1. ... 1. 1. 1.]
(10956, 300, 8)
weight0: 1.486970684039088
weight1: 0.7533003300330032
*****************************************
model_stacked_v6
Model: "sequential_18"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm_17 (LSTM)              (None, 300, 64)           18688     
                                                                 
 lstm_18 (LSTM)              (None, 300, 64)           33024     
                                                                 
 lstm_19 (LSTM)              (None, 300, 64)           33024     
                                                                 
 lstm_20 (LSTM)              (None, 300, 64)           33024     
                                                                 
 lstm_21 (LSTM)              (None, 300, 64)           33024     
                                                                 
 lstm_22 (LSTM)              (None, 300, 64)           33024     
                                                                 
 lstm_23 (LSTM)              (None, 64)                33024     
                                                                 
 dense_71 (Dense)            (None, 1)                 65        
                                                                 
=================================================================
Total params: 216,897
Trainable params: 216,897
Non-trainable params: 0
_________________________________________________________________
