(13696, 300, 8)
(13696,)
epochs: 33
Shuffle: True
[1. 1. 1. ... 1. 1. 1.]
(10956, 300, 8)
weight0: 1.486970684039088
weight1: 0.8022648514851484
*****************************************
model_bigger_biggest_lstm_v16
Model: "sequential_16"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm_16 (LSTM)              (None, 256)               271360    
                                                                 
 dense_56 (Dense)            (None, 16)                4112      
                                                                 
 dense_57 (Dense)            (None, 16)                272       
                                                                 
 dense_58 (Dense)            (None, 16)                272       
                                                                 
 dense_59 (Dense)            (None, 16)                272       
                                                                 
 dense_60 (Dense)            (None, 16)                272       
                                                                 
 dense_61 (Dense)            (None, 16)                272       
                                                                 
 dense_62 (Dense)            (None, 16)                272       
                                                                 
 dense_63 (Dense)            (None, 16)                272       
                                                                 
 dense_64 (Dense)            (None, 16)                272       
                                                                 
 dense_65 (Dense)            (None, 16)                272       
                                                                 
 dense_66 (Dense)            (None, 16)                272       
                                                                 
 dense_67 (Dense)            (None, 16)                272       
                                                                 
 dense_68 (Dense)            (None, 16)                272       
                                                                 
 dense_69 (Dense)            (None, 16)                272       
                                                                 
 dense_70 (Dense)            (None, 1)                 17        
                                                                 
=================================================================
Total params: 279,025
Trainable params: 279,025
Non-trainable params: 0
_________________________________________________________________
