(13696, 300, 8)
(13696,)
epochs: 30
Shuffle: True
[1. 1. 1. ... 1. 1. 1.]
(10956, 300, 8)
weight0: 2.973941368078176
weight1: 1.5066006600660065
*****************************************
model_stacked_v6
Model: "sequential_18"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm_17 (LSTM)              (None, 300, 8)            544       
                                                                 
 lstm_18 (LSTM)              (None, 300, 8)            544       
                                                                 
 lstm_19 (LSTM)              (None, 300, 8)            544       
                                                                 
 lstm_20 (LSTM)              (None, 300, 8)            544       
                                                                 
 lstm_21 (LSTM)              (None, 300, 8)            544       
                                                                 
 lstm_22 (LSTM)              (None, 300, 8)            544       
                                                                 
 lstm_23 (LSTM)              (None, 8)                 544       
                                                                 
 dense_71 (Dense)            (None, 1)                 9         
                                                                 
=================================================================
Total params: 3,817
Trainable params: 3,817
Non-trainable params: 0
_________________________________________________________________
